vertical-pod-autoscaler/experiments/sn-pbr-throughput/20plus/user.log
Running 15m test @ http://10.110.70.235:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 39.348ms, rate sampling interval: 135ms
  Thread calibration: mean lat.: 53.808ms, rate sampling interval: 133ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   321.10ms  296.65ms   1.30s    82.88%
    Req/Sec    14.55     10.29    44.00     72.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  218.88ms
 75.000%  457.47ms
 90.000%  748.03ms
 99.000%    1.30s 
 99.900%    1.84s 
 99.990%    2.11s 
 99.999%    2.61s 
100.000%    2.61s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.673     0.000000            1         1.00
      52.991     0.100000         2654         1.11
      79.935     0.200000         5310         1.25
     117.055     0.300000         7958         1.43
     162.047     0.400000        10610         1.67
     218.879     0.500000        13267         2.00
     254.847     0.550000        14594         2.22
     294.399     0.600000        15923         2.50
     340.223     0.650000        17241         2.86
     393.471     0.700000        18569         3.33
     457.471     0.750000        19894         4.00
     494.335     0.775000        20557         4.44
     538.111     0.800000        21224         5.00
     582.143     0.825000        21883         5.71
     625.151     0.850000        22546         6.67
     680.447     0.875000        23209         8.00
     714.751     0.887500        23542         8.89
     748.031     0.900000        23877        10.00
     782.847     0.912500        24206        11.43
     822.271     0.925000        24535        13.33
     869.375     0.937500        24867        16.00
     898.047     0.943750        25036        17.78
     927.231     0.950000        25199        20.00
     964.095     0.956250        25366        22.86
    1005.567     0.962500        25530        26.67
    1046.527     0.968750        25699        32.00
    1070.079     0.971875        25781        35.56
    1096.703     0.975000        25866        40.00
    1124.351     0.978125        25945        45.71
    1158.143     0.981250        26027        53.33
    1199.103     0.984375        26110        64.00
    1220.607     0.985938        26152        71.11
    1249.279     0.987500        26194        80.00
    1285.119     0.989062        26236        91.43
    1327.103     0.990625        26277       106.67
    1354.751     0.992188        26319       128.00
    1372.159     0.992969        26338       142.22
    1395.711     0.993750        26359       160.00
    1418.239     0.994531        26380       182.86
    1451.007     0.995313        26400       213.33
    1487.871     0.996094        26421       256.00
    1511.423     0.996484        26431       284.44
    1538.047     0.996875        26443       320.00
    1557.503     0.997266        26452       365.71
    1595.391     0.997656        26462       426.67
    1644.543     0.998047        26473       512.00
    1654.783     0.998242        26478       568.89
    1716.223     0.998437        26483       640.00
    1774.591     0.998633        26488       731.43
    1830.911     0.998828        26493       853.33
    1862.655     0.999023        26499      1024.00
    1879.039     0.999121        26501      1137.78
    1884.159     0.999219        26504      1280.00
    1912.831     0.999316        26506      1462.86
    1940.479     0.999414        26509      1706.67
    1952.767     0.999512        26512      2048.00
    1955.839     0.999561        26513      2275.56
    1960.959     0.999609        26514      2560.00
    1982.463     0.999658        26515      2925.71
    2039.807     0.999707        26517      3413.33
    2064.383     0.999756        26518      4096.00
    2097.151     0.999780        26519      4551.11
    2097.151     0.999805        26519      5120.00
    2105.343     0.999829        26520      5851.43
    2107.391     0.999854        26521      6826.67
    2107.391     0.999878        26521      8192.00
    2174.975     0.999890        26522      9102.22
    2174.975     0.999902        26522     10240.00
    2174.975     0.999915        26522     11702.86
    2545.663     0.999927        26523     13653.33
    2545.663     0.999939        26523     16384.00
    2545.663     0.999945        26523     18204.44
    2545.663     0.999951        26523     20480.00
    2545.663     0.999957        26523     23405.71
    2613.247     0.999963        26524     27306.67
    2613.247     1.000000        26524          inf
#[Mean    =      321.097, StdDeviation   =      296.652]
#[Max     =     2611.200, Total count    =        26524]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26845 requests in 15.00m, 351.65MB read
  Socket errors: connect 0, read 1, write 7, timeout 0
Requests/sec:     29.82
Transfer/sec:    400.05KB